<?php

// $Id: module-cfg.php 6484 2011-08-22 13:23:19Z infodaes $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------


$MODULE_PRO_KIND_NAME = "課表XML交換";


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="1.0.0";

// 模組最後更新日期
$MODULE_UPDATE="2011/11/19";


//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------


//目錄內程式
$menu_p= array("output_xml.php"=>"中教司班級與教師課表XML交換","output_xml_x.php"=>"國教司中小學教師員額系統課表XML交換");

$SFS_MODULE_SETUP[]=array('var'=>"years", 'msg'=>"列出的學年數", 'value'=>"6");
$SFS_MODULE_SETUP[]=array('var'=>"masks", 'msg'=>"預設身分證字號遮罩(*：遮)", 'value'=>"----------");
//$SFS_MODULE_SETUP[]=array('var'=>"x_id", 'msg'=>"中小學員額系統匯入帳號", 'value'=>"");
//$SFS_MODULE_SETUP[]=array('var'=>"x_pwd", 'msg'=>"中小學員額系統匯入密碼", 'value'=>"");


?>
