<?php

//$Id:$
include '../sfs_core_menu.php';

/*
if(!$CONN){
        echo "go away !!";
        exit;
}
*/

//生涯輔導紀錄選項

//個性(人格特質)
$temp_arr=array(1=>'穩定',2=>'謙虛',3=>'坦率',4=>'沉默寡言',5=>'堅毅',6=>'順從',7=>'實際',8=>'有條理',9=>'善於分析',10=>'喜歡思考',11=>'有好奇心',12=>'善於判斷',13=>'觀察力敏銳',14=>'保守',15=>'謹慎',16=>'獨立',17=>'富想像力',18=>'直覺',19=>'情感豐富',20=>'崇尚理想',21=>'有創意',22=>'善於表達
',23=>'不墨守成規',24=>'獨立',25=>'善解人意',26=>'人際洞察',27=>'合作',28=>'仁慈友善',29=>'善於溝通',30=>'助人',31=>'有責任心',32=>'有耐心',33=>'樂觀積極',34=>'受人歡迎',35=>'外向',36=>'有說服力',37=>'有企圖心',38=>'自信',39=>'好冒險',40=>'善於規劃',41=>'講求效率',42=>'精確
',43=>'有恆心',44=>'順從',45=>'實際',46=>'有條理',47=>'保守',48=>'謹慎');
$result=join_sfs_text(1,'個性(人格特質)',$temp_arr);

//各項活動
$temp_arr=array(1=>'修理或拆裝電腦、電器等物品',2=>'組合模型',3=>'打球、跑步等運動',4=>'種植、整理植物',5=>'飼養動物',6=>'操作電器、電子設備',7=>'組裝傢具',8=>'烘焙、烹飪、手工縫紉',9=>'做科學實驗及研究',10=>'研究數學問題',11=>'看科學知識節目、課外書',12=>'益智遊戲',13=>'研究天文、觀察星象',14=>'看推理小說、影片',15=>'參觀科學、天文類場館',16=>'寫電腦程式
',17=>'塗鴉、畫畫',18=>'演奏樂器、唱歌',19=>'寫作及閱讀',20=>'跳舞、編舞',21=>'服裝或室內設計',22=>'觀賞或參與藝文表演',23=>'做手工藝品',24=>'攝影',25=>'教同學功課、才藝',26=>'傾聽他人心事',27=>'幫助別人解決問題',28=>'參加自我成長活動
',29=>'和小組同學合作完成任務',30=>'到育幼院、養老院等進行服務學習',31=>'協助照顧病弱、身心障礙者',32=>'研究不同族群的文化、風俗民情',33=>'籌劃辦理活動',34=>'說服別人支持自己的想法',35=>'推銷物品',36=>'競選或擔任幹部
',37=>'演說或辯論',38=>'研究法律情境及條文',39=>'擔任活動主持人',40=>'擴展人際關係、結交朋友',41=>'整理圖書',42=>'上網找資料',43=>'使用電腦做文書處理',44=>'整理發票、記帳',45=>'整理筆記、文件',46=>'剪報或收集郵票、錢幣、卡片',47=>'協助影印、裝訂資料
',48=>'校對資料');
$result=join_sfs_text(1,'各項活動',$temp_arr);

//選擇職業時重視的條件
$temp_arr=array(1=>'興趣',2=>'展現專長',3=>'成就感',4=>'自我成長',5=>'工作自主',6=>'管理權力',7=>'受人尊重',8=>'穩定安全',9=>'與人互動',10=>'生活方式',11=>'工作環境',12=>'工作關係',13=>'未來升遷發展',14=>'薪資福利');
$result=join_sfs_text(1,'選擇職業時重視的條件',$temp_arr);

//生涯試探學程及群科
$temp_arr=array(1=>'學術學程（自然）',2=>'學術學程（社會）',3=>'機械群',4=>'動力機械群',5=>'電機與電子群',6=>'土木與建築群',7=>'化工群',8=>'商業與管理群',9=>'設計群',10=>'農業群',11=>'食品群',12=>'家政群',13=>'餐旅群',14=>'水產群',15=>'海事群',16=>'外語群',17=>'藝術群',18=>'護理類科');
$result=join_sfs_text(1,'生涯試探學程及群科',$temp_arr);

//生涯試探活動方式
$temp_arr=array(1=>'社區高中職參訪',2=>'分站活動（含博覽會）',3=>'專題演講、座談、入班宣導等',4=>'職群試探',5=>'生涯探索營',6=>'加深職業試探--技藝教育課程',7=>'媒體應用');
$result=join_sfs_text(1,'生涯試探活動方式',$temp_arr);

//生涯選擇方向
$temp_arr=array(1=>'高中',2=>'綜合高中',3=>'五專',4=>'高職（含實用技能學程、建教合作班等）',5=>'軍校',6=>'就業');
$result=join_sfs_text(1,'生涯選擇方向',$temp_arr);

//生涯統整面面觀
$temp_arr=array(1=>'我的人格特質',2=>'我的性向（專長能力）',3=>'我的生涯興趣',4=>'我的工作價值觀',5=>'家人對我未來職業的期待',6=>'透過生涯試探活動',7=>'我對於哪些學程或群科感到興趣');
$result=join_sfs_text(1,'生涯方向思考項目',$temp_arr);

//生涯發展規劃考慮因素-個人
$temp_arr=array(1=>'符合我的學業表現',2=>'適合我的性向（專長能力）',3=>'適合我的生涯興趣',4=>'適合我的工作價值觀',5=>'適合我的人格特質',6=>'適合我的健康狀況');
$result=join_sfs_text(1,'個人因素',$temp_arr);

//生涯發展規劃考慮因素-環境
$temp_arr=array(1=>'適合目前家庭經濟狀況',2=>'符合家人期望',3=>'社會潮流與評價',4=>'通勤距離及時間');
$result=join_sfs_text(1,'環境因素',$temp_arr);

//生涯發展規劃考慮因素-資訊
$temp_arr=array(1=>'生涯試探結果',2=>'學校入學管道與方式',3=>'學校多元社團及發展特色',4=>'未來升學就業管道');
$result=join_sfs_text(1,'資訊因素',$temp_arr);

?>