<?php
// $Id: module-cfg.php 5310 2009-01-10 07:57:56Z hami $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此  陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "newsmig";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------


$MODULE_PRO_KIND_NAME = "校園新聞";


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="1.0.0";

// 模組最後更新日期
$MODULE_UPDATE="2004/03/23";

//重要模組，免被勿刪
$SYS_MODULE=0;
//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------

$todayis = date("Y-m-d H:s",time());
$timestamp = time();

//目錄內程式
$school_menu_p = array(
"index.php"=>"新聞一覽表",
"postnews.php?act=add"=>"新增新聞"
);

//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup (傳回值為一個 array["變數名"]=值)
// 供您取用目前這個變數的最新狀況值，
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

$SFS_MODULE_SETUP[0]=
	array('var'=>"IS_STANDALONE", 'msg'=>"是否有獨立的界面(1是,0否)", 'value'=>0);


// 第2,3,4....個，依此類推： 

 $SFS_MODULE_SETUP[1]=
 array('var'=>"nums_perpage", 'msg'=>"每頁顯示筆數", 'value'=>10);

 //  數位相本內縮圖(Reductive picture)長度
 $SFS_MODULE_SETUP[2] =
	array('var'=>"SWidth", 'msg'=>"相本縮圖長度", 'value'=>200);

 //  數位相本內縮圖(Reductive picture)寬度
 $SFS_MODULE_SETUP[3] =
	array('var'=>"SLength", 'msg'=>"相本縮圖寬度", 'value'=>150);
	
// 數位相本內大圖的長度
$SFS_MODULE_SETUP[4] =
	array('var'=>"MWidth", 'msg'=>"相本大圖長度", 'value'=>640);

// 數位相本內大圖的寬度
$SFS_MODULE_SETUP[5] =
	array('var'=>"MLength", 'msg'=>"相本大圖寬度", 'value'=>480);

// headnews 是否顯示背景
$SFS_MODULE_SETUP[6] =
	array('var'=>"hn_bgimg", 'msg'=>"headnews是否顯示背景(1是,0否)", 'value'=>1);


?>
