<?php
//$Id: module-cfg.php 5310 2009-01-10 07:57:56Z hami $
// 資料表名稱定義
$MODULE_TABLE_NAME[0] = "rent_place";
$MODULE_TABLE_NAME[1] = "rent_record";
$MODULE_PRO_KIND_NAME = "場地出租管理";
//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------
// 模組最後更新版本
$MODULE_UPDATE_VER="1.0.0";
// 模組最後更新日期
$MODULE_UPDATE="2006-08-9";
//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------
//目錄內程式
$MENU_P = array(
"readme.php"=>"管理辦法","place.php"=>"場租設定","rent.php"=>"租借紀錄","rent_summary.php"=>"分析統計");
//---------------------------------------------------
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------
//$IS_MODULE_ARR = array("Y"=>"是","N"=>"否");
$SFS_MODULE_SETUP[0]=
	array('var'=>"past", 'msg'=>"已完結紀錄底色", 'value'=>"#CCCCCC");
$SFS_MODULE_SETUP[1] =
        array('var'=>"recent", 'msg'=>"一週內紀錄底色", 'value'=>"#FFFFFF");
		
$SFS_MODULE_SETUP[2] =
        array('var'=>"far", 'msg'=>"一週外紀錄底色", 'value'=>"#FFAAAA");
$SFS_MODULE_SETUP[3] =
        array('var'=>"days", 'msg'=>"舊紀錄顯示天數", 'value'=>"30");
$SFS_MODULE_SETUP[4] =
        array('var'=>"doc", 'msg'=>"辦法連結網址", 'value'=>"readme.htm");
?>
