<?php
//$Id: config.php 5310 2009-01-10 07:57:56Z hami $
//預設的引入檔，不可移除。
require_once "./module-cfg.php";
include_once "../../include/config.php";
include "../../include/sfs_case_PLlib.php";
include "../../include/sfs_case_dataarray.php";

//您可以自己加入引入檔
$status_kind=array("0"=>"待確認","1"=>"");
$check_arr=array("0"=>"待確認","1"=>"已核章");
$course_kind=array("0"=>"無課務","1"=>"自行調課","2"=>"公費排代","3"=>"教保員代理","4"=>"自費找代");
$c_course_kind=array("1"=>"自行調課","2"=>"公費排代","3"=>"自費找代");
$d_kind_arr=array("1"=>"教學鐘點","2"=>"導師時間","3"=>"全日代課");
$times_kind_arr=array("1"=>"節","2"=>"次","3"=>"日");
$month_arr=array("1"=>"一月","2"=>"二月","3"=>"三月","4"=>"四月","5"=>"五月","6"=>"六月","7"=>"七月","8"=>"八月","9"=>"九月","10"=>"十月","11"=>"十一月","12"=>"十二月");
//$abs_kind_arr=array("11"=>"事假","12"=>"家庭照顧假","21"=>"病假","22"=>"生理假","31"=>"延長病假","41"=>"婚假","42"=>"產前假","43"=>"分娩假","44"=>"流產假","45"=>"陪產假","46"=>"喪假","51"=>"公差假","52"=>"公差","61"=>"休假","62"=>"補休假","71"=>"其他");
// 人事總局假別代碼
$absExportIdArr = array(
	'事假' => '01',
	'病假' => '02',
	'休假' => '03',
	'加班補休' => '04',
	'公差' => '05',
	'公差假' => '05',
	'公假' => '06',
	'公出' => '07',
	'婚假' => '08',
	'娩假' => '09',
	'喪假' => '10',
	'慰勞假' => '11',
    '路程假' => '12',
	'流產假' => '13',
	'值日補休'=> '14',
    '公傷假' => '15',
	'延長病假' => '16',
	'留職停薪' => '17',
	'停止上班上課' => '18',
	'其他假' => '19',
	'出差補休' => '20',
	'產前假' => '21',
	'陪產假' => '22',
    '骨髓捐贈' =>'23',
    '生理假' => '24',
    '家庭照顧假' => '25',
    '災防假' => '19'
);

$post_kind=post_kind();  //職稱
$check1="單位主管";
$check2="教學組長";
$check3="校長";
$check4="人事主任";
$check5="會計主任";

require_once "./my_fun.php";

if ($_REQUEST[year_seme]) {
	$ys=explode("_",$_REQUEST[year_seme]);
	$sel_year=$ys[0];
	$sel_seme=$ys[1];
} else {
	if(empty($sel_year))	$sel_year = curr_year(); //目前學年
	
	if(empty($sel_seme))$sel_seme = curr_seme(); //目前學期
	
}

?>
