<?php
// $Id: faq.php 5310 2009-01-10 07:57:56Z hami $
include "config.php";
sfs_check();

//主選單設定
$school_menu_p=(empty($school_menu_p))?array():$school_menu_p;

$act=$_REQUEST[act];

//執行動作判斷
$main=&readme();



//秀出網頁
head("成績單製作問題集");
echo $main;
foot();

function &readme(){
	global $school_menu_p;
	//相關功能表
	$tool_bar=&make_menu($school_menu_p);
	$main="
	$tool_bar
	<table cellspacing='1' cellpadding='3' bgcolor='#C0C0C0' class='small'><tr bgcolor='#FFFFFF'><td>
	<ul style='line-height:1.5'>
	<li><b>為什麼要自訂成績單</b><p>
	因為自訂成績單可以讓學校設定學校想要的成績單格式，學校可以自行設計。</p>
	
	<li><b>自訂的成績單怎麼樣抓到內容的值呢？</b><p>
	此模組提供了一些<a href='mark.php'>可用標籤</a>，只要將需要的標籤（或欄位）放入成績單樣版中，系統就有辦法抓到對應的值。例如 {學生姓名} 到時候下載時就會自動變成學生的姓名，您可以參考這個範例：<a href='demo.sxw'>成績單範例</a></p>
	
	<li><b>我可以自訂標籤嗎？</b><p>
	目前不行，但未來或許會加入此功能。</a></p>
	
	<li><b>一個學校只要設計一個樣版嗎？</b><p>
	有些標籤是全校通用的，例如：{學校全銜}、{班級}、{學生姓名}、{座號}...等。<br>
	但是有些標籤在不同年級可能會沒有，例如學科部分，一年級有{生活}，但三年級以上就沒有該標籤，所以要注意一下。</p>
		
	<li><b>一個年級可以有很多樣版嗎？</b><p>
	當然可以，並沒有限制，愛做幾個就做幾個。</p>
	
	<li><b>一個樣版可以用好幾年嗎？</b><p>
	可以，如果您的課程幾年都沒有變動的話。「學科相關標籤」會視課程設定而產生，因此，如果您下學期的課程設定不一樣了，那麼成績單必然也要修改。</p>
	
	<li><b>可以把樣版分享給別校使用嗎？</b><p>
	當然可以，如果別校的科目設定和您一樣的話，那就完全 OK。不過，萬一有些科目不一樣，那麼對方可能要把「學科相關標籤」稍做修改才能用。</p>
	
	<li><b>樣版做錯了怎麼辦？</b><p>
	利用修改功能修改一下就好了。或者刪除錯的樣版，然後再把新的丟上去即可。</p>
	
	
	<li><b>為什麼有些學生其標籤值是空的？</b><p>
	可能因為老師還沒輸入完資料，例如，老師若還沒輸入 A 的評語，那麼，A 學生評語一欄就會是空的。</p>
	
	<li><b>標籤還會增加嗎？</b><p>
	很有可能，只要學校有需求，反應後，開發小組便會開發所需標籤，當然，這些標籤必須是系統可以抓得到其對應值。</p>
	
	<li><b>{九_健康與體育} 和 {健康與體育-健康}、{健康與體育-體育} 有什麼不一樣？</b><p>
	這種情況通常是把「健康與體育」領域，分科成「健康」與「體育」兩科。{九_健康與體育} 表示會依照分科的加權來計算整個「健康與體育領域」的成績；{健康與體育-健康}、{健康與體育-體育} 則是單獨該科的成績，沒有加權。</p>
	
	<li><b>{事假} 和 {事假_成} 或 {大功_成} 和 {大功} 有什麼不一樣？</b><p>
	您會發現，在缺曠課和獎懲標籤都各有兩種，一種是有寫一個「成」的標籤，這是後來新增的標籤。因為有些學校沒有使用獎懲或缺曠課模組，因此，無法使用 {事假} 或 {大功} 標籤。</p><p>	
	因為在製作成績單中也可以輸入缺曠課或者獎懲記錄，因此，才多了這種新標籤，亦即 {事假_成} 或 {大功_成} ，以便抓取直接從製作成績單中所輸入的缺曠課或獎懲的值。
	</p><p>
	簡單的說，如果貴校有使用標準的獎懲或缺曠課模組，那麼請使用 {事假} 或 {大功} 這類的標籤。
	</p><p>
	如果貴校沒有使用標準的獎懲或缺曠課模組，而是直接在製作成績單輸入缺曠課及獎懲情況時，請用 {事假_成} 或 {大功_成} 這種標籤。</p>
	
	<li><b>此模組會需要搭配其他模組嗎？</b><p>
	當然要，您必須把課程設定好，才會有科目標籤；要有學生資料，才抓得到學生標籤；要有獎懲紀錄（reward 模組），才抓得到獎懲標籤的對應值；要有缺曠課記錄（absent 模組），才抓得到缺曠課標籤的對應值；最後，老師當然得打成績，以及該科目的評語...等，這樣成績才會出現喔！</p>
	</ul>
	</td></tr></table>";
	return $main;
}
?>