<?php

//$Id: module-cfg.php 5310 2009-01-10 07:57:56Z hami $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "docup";
$MODULE_TABLE_NAME[1] = "docup_p";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------

$MODULE_PRO_KIND_NAME = "文件資料庫";

//本模組須區分管理權
$MODULE_MAN = 1 ;
//管理權說明
$MODULE_MAN_DESCRIPTION = "具有管理權人員,可刪修所有文件";

//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "相關系統程式" 取用)
//
//---------------------------------------------------

// 模組版本
$MODULE_UPDATE_VER="2.0.1";

// 模組最後更新日期
$MODULE_UPDATE="2005-11-08 10:00:00";

//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//------------------------------^^^^^^^^^^
//
// (不想被 "模組設定" 程式控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//---------------------------------------------------

//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組設定" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//---------------------------------------------------

// 第2,3,4....個，依此類推： 

// $SFS_MODULE_SETUP[1] =
//	array('var'=>"xxxx", 'msg'=>"yyyy", 'value'=>0);

// $SFS_MODULE_SETUP[2] =
//	array('var'=>"ssss", 'msg'=>"tttt", 'value'=>1);

$SFS_MODULE_SETUP[0] =array('var'=>"is_standalone", 'msg'=>"是否有獨立界面", 'value'=> array("0"=>"否","1"=>"是"));
?>
