<?php
//$Id: config.php 6064 2010-08-31 12:26:33Z infodaes $
include_once "../../include/config.php";
include_once "../../include/sfs_case_dataarray.php";
require_once "./module-cfg.php";
require_once "./my_fun.php";

//取得模組參數的類別設定
$m_arr =&get_module_setup("sms_apol");
extract($m_arr,EXTR_OVERWRITE);

$menu_p = array("sms_teacher.php"=>"發送給教職員","sms_guardian.php"=>"發送給班級學生監護人","sms_sp_guardian.php"=>"發送給特殊身分學生監護人","sms_record.php"=>"發送記錄","sms_statistics.php"=>"發送統計");

$statuscodeArray=array(
'0'=>'成功\',
'00'=>'上傳成功\',
'01'=>'預約中',
'11'=>'系統正在處理(展開明細中)',
'12'=>'系統已將簡訊送至簡訊中心',
'21'=>'使用者取消',
'22'=>'非法簡訊',
'23'=>'點數不足',
'24'=>'上傳失敗',
'25'=>'傳送失敗',
'21'=>'使用者取消(CANCEL)',
'25'=>'傳送失敗(SNDFAIL/TIMEOUT)',
'26'=>'逾時失敗(EXPIRED)',
'27'=>'空號失敗(DELETED/UNDELIV)',
'28'=>'傳送失敗(UNKNOWN)',
'29'=>'傳送失敗(REJECTD)',
'30'=>'傳送中(尚未得到簡訊狀態)',
'99'=>'成功(DELIVRD/ACCEPTD)',
'16777217'=>'認證失敗(用戶/企業代表號不存在或密碼錯誤)',
'16777218'=>'來源IP未授權使用',
'16777219'=>'指定帳號不存在(或空白)',
'33554433'=>'額度不足(或合約已開通未儲值)',
'33554434'=>'連線數超過上限',
'33554435'=>'Callback未申請授權使用',
'33554436'=>'國際簡訊未授權使用',
'33554437'=>'網內簡訊未授權使用',
'33554438'=>'網外簡訊未授權使用',
'33554439'=>'合約已終止，停止使用',
'33554440'=>'帳號已終止，停止使用',
'33554441'=>'帳號已鎖定(密碼錯誤超過三次以上)',
'33554448'=>'未授權此功能',
'50331649'=>'參數不足',
'50331650'=>'交易代號不存在',
'50331651'=>'門號格式錯誤',
'50331652'=>'日期格式錯誤',
'50331653'=>'其他格式錯誤',
'50331654'=>'接收門號數量超過上限',
'50331655'=>'簡訊本文含有非法關鍵字',
'50331656'=>'簡訊長度過長',
'50331657'=>'長簡訊則數已超過上限',
'50331664'=>'簡訊主旨不存在(或空白)',
'50331665'=>'API簡訊發送啟始時間(StartDateTime)需晚於API呼叫時間',
'50331666'=>'API簡訊發送結束時間(StopDateTime)需晚於發送起始時間以及起始時間+24小時之內',
'50331667'=>'簡訊已全部送出，無法異動(刪除簡訊失敗/預約簡訊本文修改失敗)',
'50331668'=>'變更密碼失敗(長度不足或過長)',
'50331669'=>'異動點數長度不符',
'50331670'=>'異動點數格式錯誤',
'286331153'=>'例外錯誤發生',
'51450129'=>'系統維護時段，暫停使用');

?>
