# $Id: soft_data.sql 5311 2009-01-10 08:11:55Z hami $
# Table structure for table 'softm'
#

CREATE TABLE softm (
   tapem_id char(2) NOT NULL,
   tapem_name char(30) NOT NULL,
   PRIMARY KEY (tapem_id)
);

#
# Dumping data for table 'softm'
#

INSERT INTO softm VALUES( 'A', '自然類');
INSERT INTO softm VALUES( 'B', '資訊類');
INSERT INTO softm VALUES( 'C', '社會類');
INSERT INTO softm VALUES( 'D', '藝術類');
INSERT INTO softm VALUES( 'E', '道健類');
INSERT INTO softm VALUES( 'F', '體育類');
INSERT INTO softm VALUES( 'G', '特教類');
INSERT INTO softm VALUES( 'I', '其他類');
INSERT INTO softm VALUES( 'H', '綜合類');
INSERT INTO softm VALUES( 'J', '圖庫類');
INSERT INTO softm VALUES( 'k', '語文類');
INSERT INTO softm VALUES( 'L', '音樂類');


#
# Table structure for table 'soft'
#

CREATE TABLE soft (
   tapem_id char(2) NOT NULL,
   tape_id smallint(4) NOT NULL,
   tape_name varchar(60) NOT NULL,
   tape_grade varchar(30) NOT NULL,
   tape_memo text NOT NULL,
   PRIMARY KEY (tapem_id, tape_id)
);

#
# Dumping data for table 'soft'
#

INSERT INTO soft VALUES( 'A', '1', '魚樂世界', '', '網頁呈現方式(IE)');
INSERT INTO soft VALUES( 'A', '2', '台灣的地質景觀', '', '網頁呈現方式(IE)
');
INSERT INTO soft VALUES( 'A', '3', '一河口的生物世界二讓我們看雲去', '', '網頁呈現方式(IE)
');
INSERT INTO soft VALUES( 'A', '4', '蝶羽蝶語v2', '', '提供256色和全彩兩種選擇，滿足不同電腦規格，一片CD兩種享受，音響和個人電腦都可使用。');
INSERT INTO soft VALUES( 'A', '5', '一溪流生態環境  二臺灣的溪流魚', '', '台灣省政府教育廳
視聽光碟輔助教材
');
INSERT INTO soft VALUES( 'A', '6', '生命現象', '', '動物型態,分類,棲息環境.校園小動物
');
INSERT INTO soft VALUES( 'A', '7', '人體大百科v2', '', '請您一齊來探索多采多姿的人體世界！');
INSERT INTO soft VALUES( 'A', '8', '宇宙大百科v2', '', '一部必備的多媒體百科光碟，讓您置身宇宙知識之海，體驗神秘太空之境。');
INSERT INTO soft VALUES( 'A', '9', '天文學習百科v2', '', '國內第一片從中國天文科學成就出發的天文知識類百科電子書，內容透過兩個主角人物，一是生於現代的小張衡，以及中國古代天文大師張衡
，藉著兩人的相遇帶出天文知識的介紹，是知識類電子書的一大創新。');
INSERT INTO soft VALUES( 'A', '10', '動物學習百科v2', '', '閱\讀三十個動物常識，可進一步充實相關知識。');
INSERT INTO soft VALUES( 'A', '11', '機械大百科v2', '', '家庭光碟圖書館');
INSERT INTO soft VALUES( 'A', '12', '一常見的植物 二台灣昆蟲群組', '', '1.台灣省政府教育廳視聽光碟輔助教學
2.台灣省政府教育廳視聽媒體光碟輔助教學
');
INSERT INTO soft VALUES( 'A', '13', '自然大百科', '', '一部必備的多媒體百科光碟，引領您進入奧妙的自然世界。');
INSERT INTO soft VALUES( 'A', '14', '台灣的珊瑚礁魚類v2', '', '蔚藍的大海中有一座秘密花園，無數的花仙子在此悠然起舞，訴說─大自然最奇妙的生態奧秘。
來，跟隨嘉利博，展開一場知性與感性兼具的海底探密之旅。');
INSERT INTO soft VALUES( 'A', '15', '發現腔棘魚', '', '「發現腔棘魚」光碟片包含了「潛艇模式」及「手冊模式」兩種，分別涵蓋\了「演化之謎」、「發現歷史」、「生物特徵」、「絕種危機」、「問答百科」以及「相關網站」等豐富內容。配合教育部「終身學習光碟系列」以及網際網路的推廣，期此珍貴的海洋保育知識，能為社會大眾所共享並予重視。');
INSERT INTO soft VALUES( 'A', '16', '植物篇 ﹝臺中縣鄉土教材﹞', '', '植物篇
');
INSERT INTO soft VALUES( 'A', '17', '多媒體CAI', '', '生物篇
');
INSERT INTO soft VALUES( 'A', '18', '開天闢地', '', '\"地球科學,恐龍\"
');
INSERT INTO soft VALUES( 'A', '19', '快樂的小精靈v2', '', '鳥類
');
INSERT INTO soft VALUES( 'A', '20', '一蜻蜓 二常見的鳥', '', '台灣省政府教育廳
視聽光碟輔助教材
鄉土自然〈三〉');
INSERT INTO soft VALUES( 'A', '21', '小魚兒握握手v2', '', '提供256色和全彩兩種選擇，滿足不同電腦規格。');
INSERT INTO soft VALUES( 'A', '22', '台灣的蝴蝶v2', '', '認識蝴蝶身體的部位，器官構造和奇妙功\能，蝴蛾的不同，以及生活史。了解各科特徵、習性、種類；以及台灣特有種類。');
INSERT INTO soft VALUES( 'A', '23', '恐龍大百科v2', '', '進入恐龍虛擬實境博物館，運用您的智慧，讓恐龍再度復活！');
INSERT INTO soft VALUES( 'A', '24', '蝴蝶--會飛的花朵v2', '', '大地系列VCD之一
﹝片長約三十分鐘﹞
您知道嗎？蝴蝶須歷經驚險萬分的過程，才能從幼蟲羽化成蝶。透過攝影機引導，為您捕捉蝴蝶生命中的點點滴滴，從求偶、產卵、化蛹、羽化、採蜜到逃避天敵...。
求愛最高招：看蝴蝶爸爸用曼妙求偶舞，打敗情敵贏得蝴蝶媽媽的芳心。
生命的起始：生命從小小的卵開始。蝴蝶媽媽會為寶寶選擇最舒適的綠眠床。
只要我長大：破殼而出的小毛蟲，第一餐\是什麼？
小蟲本領大：蝴蝶有哪些偽裝術？牠如何嚇退天敵？
神奇魔術師：咦！躲進魔術箱的毛毛蟲，為什麼出來就有美麗的翅膀？
緊張的一刻：糟糕！誤闖蜘蛛魔王奪命八卦陣的蝴蝶，將如何脫身呢？
大家一起來：嗶！蝴蝶家族大集合，齊到花仙子樂園郊遊。
紫斑蝶越冬：猜猜看？神秘的紫斑蝶選擇哪裡躲避寒冷的冬天？
還有更多，更多....
');
INSERT INTO soft VALUES( 'A', '25', '昆蟲--大自然的神秘客v2', '', '大地系列VCD之二
﹝片長約三十分鐘﹞
台灣是有明的昆蟲寶庫，已發現的昆蟲就有一萬三千多種，相信您一定看過、聽過獨腳仙、鍬型蟲、金龜子、天牛、蟋蟀、蝴蝶、蜜蜂....。但是您可能不知道，台灣的鍬型蟲已發現的就有三十八種，天牛有七百多種，金龜子有二百多種，其中前腳特長的台灣長臂金龜，還是世界其他地方看不到的特有亞種呢。鍬型蟲素有君子之風，即使再搶奪地盤時，也不會致對手於死地。有明的逐臭之夫糞金龜、牛屎龜，最愛滾糞球。蟬、蟋蟀、螽斯都是一鳴驚人，蟬用腹部下方的發聲膜發音，蟋蟀、螽斯則是摩擦前翅發聲。還有許\多水中豪傑：水黽、紅娘華、蜻蜓，負子蟲....等，您是不是已迫不及待的想進行一場夏日小宇宙的大冒險。走！讓我們跟著昆蟲的腳步，諦聽大自然的心聲。
');
INSERT INTO soft VALUES( 'A', '26', '鳥類--天地的遊俠v2', '', '大地系列VCD之三
﹝片長約三十分鐘﹞
台灣豐富多變的自然生態，造就出獨特的鳥類溫床。不論是「原住民」的留鳥或是「來做客」的候鳥，都依自己的喜好找到舒適的棲息場所。不論是低海拔、中海拔、高海拔、溪流、河口、沼澤...都可以發現鳥蹤。麻雀、白鷺鷥、白耳畫眉、翠鳥、小燕歐、黃腹琉璃、藍腹鷳、赤腹鷹、黑面琵\鷺...。
在溪流環境中，「天才小釣手」翠鳥有什麼秘密武器，能在捕魚時百發百中。
台灣藍鵲如何贏得「長尾山娘」美稱？
誰是鳥類中的長腿叔叔？擁有什麼好本領。
飛的高不稀奇，擅游泳才神氣，誰是鳥類中的游泳高手？
長個大花臉，啼聲像敲木魚，五色鳥的綽號是「森林裡的大和尚」。
「天地間的遊俠」是您專屬圖鑑，有聲有色的帶您到山巔水湄和這群特別的小精靈做朋友。

');
INSERT INTO soft VALUES( 'A', '27', '珊瑚--美人魚的眼淚\v2', '', '大地系列VCD之四
﹝片長約三十分鐘﹞
珊瑚是最戀家的動物，從不說話的牠，卻會用繽紛多變的色彩來傳達喜、怒、哀、樂。
珊瑚的種類有一千多種以上，台灣附近的海域至少有三百多種珊瑚。這些變化萬千的珊瑚聚落，幻化出絢麗多彩的台灣海底世界。
春天是珊瑚最期待的季節，大多數的珊瑚都在此時生殖產卵。一顆顆的精卵束就從珊瑚蟲口中排放出來，或粉紅或橙黃或乳白，如百花競豔般爭放，如煙火般炫爛輝煌，在靜謐的海底中熱鬧喧闐。精子、卵子結合後的受精卵在二十四小時內發育成實囊幼蟲，緊接著進入飄浮期，尋找百萬分之一的生存機會。

');
INSERT INTO soft VALUES( 'A', '28', '青蛙--跳躍的王子v2', '', '大地系列VCD之五
﹝片長約三十分鐘﹞
有人說青蛙是最能代表台灣特色的生物，一點兒也沒錯，地處亞熱帶的台灣，氣候溫暖潮濕，造就出獨特的兩棲類天堂。台灣擁有三十多種的兩棲類生物，其中，三分之一是只有在台灣才看得到的特有種。您見過幾種呢？
您知道嗎？樹蛙能爬樹？雌蛙的體型比雄蛙大？有蒙面俠之稱的樹蟾到底是青蛙還是蟾蜍？蝌蚪如何變青蛙？小雨蛙為什麼喜歡吹氣球？青蛙吃東西時為什麼要把眼球縮進去？山椒魚市因為聞起來像山椒而得名的嗎？還有小雨蛙、蟾蜍、赤蛙...。
就讓我們一起尋寶拜訪台灣的蛙族。');
INSERT INTO soft VALUES( 'A', '29', '海底世界--龍王的水晶宮v2', '', '大地系列VCD之六
﹝片長約三十分鐘﹞
四面環海的臺灣，海岸地形多變：斷層海岸、河口灘地海岸、珊瑚礁海岸...，因而創造出豐富多元的海底景觀。面對浩瀚海洋，您是否曾經好奇，蔚藍的海面下，有沒有美人魚？水晶宮？
只要三十分鐘，帶您遊遍野柳、澎湖、綠島、蘭嶼、墾丁...的海底奇觀，展開一場奇妙的內太空之旅。
隨著鏡頭，角蝶、獅子魚、光鰓雀鯛、海蛇、虎鯨、海豚...各種海洋生物一一現身。更妙的是：變男變女的金魚花：雄魚遽減後，雌魚會自動「變性」澄雄魚，完成延續種族使命。致命的吸引力：小丑魚可以和帶有劇毒的海葵，和平共生。海草？海蛇！：惡作劇的海蛇常將尾巴釘入沙地，假裝海草偷襲粗心的魚兒。共跳漩渦之舞：沙丁魚最愛成群擠在一塊兒迴游，形成壯觀的「沙丁魚漩渦」。隱身專家：比目魚為了「觀察敵情」，兩隻眼睛竟可以長在同一邊。 
');
INSERT INTO soft VALUES( 'A', '30', '小宇宙悄悄話v2', '', '
');
INSERT INTO soft VALUES( 'A', '31', '環境保育v2', '', '天空的破洞臭氣層危機
奇花異草-珍稀植物保育
認識酸雨
空氣汙染的元兇
節約能源
不速之客
溫室效應-讓地球溫度升高
資源回收-從自己開始');
INSERT INTO soft VALUES( 'A', '32', '人與環境', '', '國立台灣科學教育館
終身學習光碟系列
');
INSERT INTO soft VALUES( 'A', '33', '女媧補天', '', '國立台灣科學教育館 
終身學習光碟系列 
');
INSERT INTO soft VALUES( 'A', '34', '認識我們愛護我們', '', '中華民國教育部
終身學習光碟系列 
台灣樹蛙與金門鳥類的呼喚');
INSERT INTO soft VALUES( 'B', '1', '音樂半日通v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'B', '2', 'DIY半日通v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'B', '3', 'WINDOWS半日通v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'B', '4', 'WORD97初學概論v2', '', '校園專業教育版
');
INSERT INTO soft VALUES( 'B', '5', 'INTERNET初學概論v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'B', '6', '注音快槍手', '', '以電動玩具方式、震撼的音效、吸引人的故事情節讓您練習各種電腦打字的技能。使用本軟體能迅速學會電腦打字，並兼顧樂趣，適合全家大小各種年齡使用者。');
INSERT INTO soft VALUES( 'B', '7', '超級點一點v2', '', 'windows 圖文輔助加強工具
');
INSERT INTO soft VALUES( 'B', '8', '動畫式卡片海報DIY', '', '1.提供各式卡片、海報製作內容，讓創意充分發揮。
2.操作功\能簡便，讓小朋友輕鬆做。
3.充分表達情意。處盡人際關係的最好工具。
4.各種功\能效果齊備，培養小小美術設計大師。
5.訓練小朋友的想像力、創造力、美術設計和美感的最佳教學軟體。');
INSERT INTO soft VALUES( 'B', '9', '動畫半日通v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'B', '10', '一舉成名v2', '', '校園專業教育版
名片 賀卡製作');
INSERT INTO soft VALUES( 'B', '11', '趣味電腦入門v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'B', '12', 'BCC半日通v2', '', '校園專業教育版');
INSERT INTO soft VALUES( 'C', '1', '冠上加冠v2', '', '\"台灣廟,古早厝\"
');
INSERT INTO soft VALUES( 'C', '2', '台灣鄉土文化資訊系統', '', '\"鄉土文化,原住民（使用網頁瀏覽器)\"
');
INSERT INTO soft VALUES( 'C', '3', '認識台灣', '', '為提供學生與社會大眾對其所生所長的土地有一完概念，將以地圖、文字、圖像、聲音、動畫等方式，呈現台灣人文、社會、地理、歷史、教育等不同面向，並採用〈互動式〉的模式，使用者可以藉著超連結(Hyperlink)表現型態，依自己喜愛或學習程度自由選取所需資訊，提供一極佳的自學工具！跳脫傳統團體學習限制，擴大學習層面，以其配合教育部所提倡的終身學習政策。 ');
INSERT INTO soft VALUES( 'C', '4', '綠丫子的綠動', '', '木雪嵐山藍暉
');
INSERT INTO soft VALUES( 'C', '5', '星期天敲敲門', '', '花野夢綠流雲
');
INSERT INTO soft VALUES( 'C', '6', '孫中山先生紀念地巡禮', '', '介紹國父  孫中山先生的出生地廣東翠亨村及其幼年至求學過程中對其具影響力的朋友及事件。');
INSERT INTO soft VALUES( 'C', '7', '美麗五千年﹝一﹞', '', '人與服飾
');
INSERT INTO soft VALUES( 'C', '8', '美麗五千年﹝二﹞', '', '人與宇宙
');
INSERT INTO soft VALUES( 'C', '9', '炎黃戰蚩尤', '', '1.遠苦的神話和今天科學有著密不可分的關聯性，我們嘗試以現代的角度來欣賞古人的智慧結晶，重新將神話以科學加以詮釋，為傳統的神話故事，給予新的生命。
2.『炎黃戰蚩尤』首次統一中華民族各原始部落，指南車也成了先民第一件科技發明；我們以詳實的圖文、專業的語音解說，讓孩子們了解老祖宗科學精神。');
INSERT INTO soft VALUES( 'C', '10', '教育資源篇', '', '為達到終身學習之目標，本光碟以本管為中心提供全方位的教育資源與服務，針對各單元提供的資料，做一詳盡的分類與介紹，加上光碟【搜尋引擎】的強大功\能以求達到方便、簡單、容易學習的境界。
為增加學習的趣味性與參與度，因此創造出本光碟的靈魂人物“終身學習小顧問”一同加入快樂學習、健康成長的行列，為你評量學習的方向，透過【遊戲】方式讓社會大眾了解終身學習的正確觀念，並增加【終身學習小顧問螢幕保護程式】他會隨時隨地出現您的面前來提供您學習新知與立志小品等，並且在【個人筆記】及【好友推薦區】我們在此提供與你學習互動的地方。');
INSERT INTO soft VALUES( 'C', '11', '台灣原住民衣飾文化之旅', '', '介紹台灣原住民的衣飾。');
INSERT INTO soft VALUES( 'C', '12', '中國人的科學智慧', '', '本多媒體電腦教材主要是已國立自然科學博物館中國科學廳之『中國的科學與技術』展示內容為素材，配合中小學自然、地球科學教材，介紹中國鴉片戰爭以前自然科學和生產技術的發展狀況。
由於中國科技之範圍成就極為廣泛，如天文氣象學、數學、地學、水利建築、物理學、冶金化學、農學、生物學、醫藥學及其他技術發明...等，可謂包羅萬象，不勝枚舉。因此本教材內容僅先以「天文地學」、「數學」、「建築與橋樑」三大單元，其發明原理與功\能，以作為中國人科學與智慧的代表。');
INSERT INTO soft VALUES( 'C', '13', '卑南遺址與文化', '', '考古篇');
INSERT INTO soft VALUES( 'C', '14', '掌中天地寬', '', '布袋戲
');
INSERT INTO soft VALUES( 'C', '15', '中縣鄉土教學補助教材﹝一﹞', '', '廟宇篇
');
INSERT INTO soft VALUES( 'C', '16', '中縣鄉土教學補助教材﹝二﹞', '', '古蹟篇
');
INSERT INTO soft VALUES( 'D', '1', '認識台灣鄉土藝術', '', '台灣鄉土藝術文化源遠流傳，本光碟將介紹「陶瓷」、「玻璃」、「石雕」、「木雕」四項藝術的發展、用途、技法及作品欣賞。 
');
INSERT INTO soft VALUES( 'D', '2', '京劇大觀園', '', '京劇養成教育坐科八年，戲園子生活既多彩又神秘，透過角色扮演遊戲，從基本功\到唱唸作打，再到臉譜、裝扮，引領你來一趟，虛擬京劇傳奇之旅。');
INSERT INTO soft VALUES( 'D', '3', '大家來唱歌仔戲', '', '傳統戲曲是中華民族珍貴的文化資產，而歌仔戲是台灣戲曲文化的代表、她的曲調悅耳動聽，廣為民眾所喜愛。為廣歌仔戲，並提供歌仔調喜愛者自學自唱的工具，故製作本光碟，配合終身學習之目標，以期達成文化資源與全民共享的理想。');
INSERT INTO soft VALUES( 'D', '4', '書法的奧秘', '', '歡迎使用本光碟，製作本張光碟的用意，是在於推廣中國書法終身學習，藉由歷代、當代名家書法作品的介紹，書法用具的欣賞與選購注意
事項、書體學習、專用名詞解釋、相關網站提供、有趣的書法小故事，以及學習評量遊戲等單元，以整體豐富的內容，搭配現代感的設計風格，使學習者在學習書法的過程中，不再感到艱深難懂，進而感到活潑生動，生趣盎然，提昇書法學習的效益。');
INSERT INTO soft VALUES( 'D', '5', '音樂入門篇', '', '讓我們一起來認識五線譜，學會每個音符正確音名和唱名。');
INSERT INTO soft VALUES( 'D', '6', '藝術學習百科v1', '', '天文學習百科系國內第一片從中國天文科學成就出發的天文知識類百科全書，內容透過兩個主角人物，一是生於現代的小張衡，以及中國古代天文大師張衡，藉著兩人相遇帶出天文知識的介紹，是知識類電子書的一大創新。');
INSERT INTO soft VALUES( 'D', '7', '兒童水墨畫', '', '水墨畫是我國特有的國賥，傳統文化的精髓。為了讓人從小就有機會接觸認識這項藝術瑰寶，小學美勞課程自二年級起，就加入了有關水墨畫教學的內容，以寓教學於遊戲的方式，引導小朋友進入筆墨的有情世界裡。');
INSERT INTO soft VALUES( 'D', '8', '葉火成逝世三週年紀念專輯', '', '葉火城先生是一位春風化雨的教育家，一位游於繪藝之樂的國寶級畫家，更是一位致力慈善事業的慈善家。');
INSERT INTO soft VALUES( 'D', '9', '雕刻之美v2〈臺灣傳統建築裝飾藝術〉', '', '\"石雕,木雕,磚雕\"
');
INSERT INTO soft VALUES( 'D', '10', '塑造之美v2〈臺灣傳統建築裝飾藝術〉', '', '\"交趾燒,泥塑,瓷燒,銅塑\"
');
INSERT INTO soft VALUES( 'D', '11', '鑲嵌之美v2〈臺灣傳統建築裝飾藝術〉', '', '\"剪粘,洗石\"
');
INSERT INTO soft VALUES( 'D', '12', '彩繪之美v2〈臺灣傳統建築裝飾藝術〉', '', '\"壁畫,彩繪\"
');
INSERT INTO soft VALUES( 'D', '13', '組砌之美v2〈臺灣傳統建築裝飾藝術〉', '', '\"磚,瓦,石,木\"
');
INSERT INTO soft VALUES( 'D', '14', '彩瓷之美v2〈臺灣傳統建築裝飾藝術〉', '', '磁磚
');
INSERT INTO soft VALUES( 'D', '15', '立體十二生肖紙雕v2', '', '立體紙雕');
INSERT INTO soft VALUES( 'D', '16', '立體恐龍王國紙雕v2', '', '立體紙雕');
INSERT INTO soft VALUES( 'D', '17', '世界動物村紙雕v2', '', '世界動物紙雕設計');
INSERT INTO soft VALUES( 'D', '18', '立體海洋世界紙雕v2', '', '立體紙雕');
INSERT INTO soft VALUES( 'D', '19', '昆蟲博物館紙雕v2', '', '昆蟲紙雕設計');
INSERT INTO soft VALUES( 'D', '20', '編織工藝博物館特藏', '', '介紹編織工藝管資訊 欣賞百餘件館藏精品 虛擬實境遊覽編織工藝館 編織技法實作範例
');
INSERT INTO soft VALUES( 'E', '1', '養生藥膳', '', '製作本CD片的目的，再透過網際網路，提供全民健康資訊及學習通道。在理論方面，除了提供一般民眾基礎營養知識外，同時加入了現代營養學中計算食物熱量的方式，以協助使用者判斷日常飲食習慣是否均衡。');
INSERT INTO soft VALUES( 'E', '2', '食療養生', '', '終身學習光碟系列');
INSERT INTO soft VALUES( 'E', '3', '認識日需量', '', '「吃得剛剛好」、「怎麼吃才好」兩大單元。');
INSERT INTO soft VALUES( 'E', '4', '帶小豬回家', '', '自身安全
');
INSERT INTO soft VALUES( 'F', '1', '傳統童玩，籠球', '', '「好學專輯〈十五〉」共包含二套教學軟體，必須在Windows95環境下執行，「童玩天地」主要以中國故有的小玩藝及操作類和益智類童玩為主。另外還有數首兒童歌謠教唱。而「籠球」為目前教學過程中需要逐步示範的教材類型其中一項。但礙於多種因素，只是何進行個別傳授或小組傳授。透過CAI不厭其煩的重複展示教材的特性，可依不同的受眾調整學習的時間；同時也有豐富的說明文字、gif圖片、avi影片穿插其中。便於使用者自我學習。');
INSERT INTO soft VALUES( 'F', '2', '國術運動 一', '', '學生練習國術潛能做好「舒筋」等熱身運動，已增加筋肉的彈性、收縮性，避免造成運動傷害。平時勤做「站樁」根本功\夫，使雙腿強健靈活
、鍛鍊下盤、穩定五臟六胕、調理氣息、修養心志。「握拳」和「出掌」均以順乎筋骨、合於自然生理結構、靈活、利於變化運用為要。');
INSERT INTO soft VALUES( 'F', '3', '國術運動 二', '', '透過「教才示範說明」、「分解動作示範說明」，教導學生了解套路中，動作之連串、組合、變化及其節奏，並利用「連續動作練習」，讓學生熟練各套路動作之連串、編配、節奏及韻律，最後以「應用舉例」做真實情境之模擬，讓學生在有了基本動作的了解後，親眼目睹實際運用之情境，印象必更為深刻，更能提昇學習之興趣、增強學習之動機。');
INSERT INTO soft VALUES( 'F', '4', '國術運動三', '', '同國術運動一、二。');
INSERT INTO soft VALUES( 'G', '1', '特教教育網', '', '網頁呈現
');
INSERT INTO soft VALUES( 'G', '2', '特教媒體教材園', '', '網頁呈現
');
INSERT INTO soft VALUES( 'G', '3', '阿寶的天空', '', '網頁呈現
');
INSERT INTO soft VALUES( 'I', '1', '廣播節目百寶箱', '', '「廣播節目百寶箱」教育光碟是由教育廣播電台企劃製作，其宗旨在於透過本教育光碟的趣味性及互動性的功\能，提供中小學校作為認識教育廣播電台的功\能與了解廣播節目製作流程的輔助教學工具。本光碟的特色是透過電腦技術的應用創造「虛擬錄音室」讓使用者得以彷如親臨撥音室現場，並能操作實習節目製作設備進而引起學習興趣，不失為是良好的輔助教材及宣傳媒體。');
INSERT INTO soft VALUES( 'I', '2', '虛擬博物館一v2', '', '中華民國教育部
終身學習光碟系列');
INSERT INTO soft VALUES( 'I', '3', '虛擬博物館二', '', '中華民國教育部
終身學習光碟系列');
INSERT INTO soft VALUES( 'H', '1', '多媒體輔助教學一v2', '', '鳥.花.針孔成像.魚.植物
');
INSERT INTO soft VALUES( 'H', '2', '多媒體輔助教學二v2', '', '顯微鏡.星宿.各大洲地形氣候.
');
INSERT INTO soft VALUES( 'H', '3', '多媒體輔助教學三v2', '', '紙雕.音樂.主機板.月球.
');
INSERT INTO soft VALUES( 'H', '4', '多媒體輔助教學四v1', '', '嬰仔歌.童謠.掌中天地寬
');
INSERT INTO soft VALUES( 'H', '5', '好學專輯一', '', '電腦輔助教學軟體----好學專輯，是以目前先進的科技，將教育部及教育廳、局所開發的電腦輔助教學軟體，總製作成光碟片〈CD-ROM〉，我們希望這套專輯的開發製作能提供師生一項豐富的教學資源，並使資訊教育向下紮根工作，能向前跨前一大步。');
INSERT INTO soft VALUES( 'H', '6', '好學專輯三v2', '', '近年來電腦科技日新月益，CAI軟體的開發技術亦不斷的再創新與突破，本次專輯品質較上一輯更加精進，大部分的軟體都在彩色螢幕上使用，畫面更美觀；有一些軟體則是用「角色扮演」的方式來進行，可提供學習的興趣，真正達到寓教於樂的效果。');
INSERT INTO soft VALUES( 'H', '7', '好學專輯八益智遊戲v2', '', '教育部位增進同學使用電腦興趣，將本部歷年發展各種益智遊戲類軟體整成好學專輯﹝八﹞光碟片，內容包羅萬象，舉凡環保尖兵、資源保育、健康世界、數學天地、電腦入門等，都可透過本專輯進行多元化學習，讓同學多采多姿的電腦世界，直得一探究竟。');
INSERT INTO soft VALUES( 'J', '1', '符號.pop.底紋.紙材圖庫v2', '', '許\多功\能');
INSERT INTO soft VALUES( 'J', '2', '瑞獸圖庫v2', '', '龍、鳳、虎、象、獅、麒麟、水族、精選100');
INSERT INTO soft VALUES( 'J', '3', '花間集圖庫v2', '', '磚刻、剪粘、彩繪、泥塑、花鳥精選100');
INSERT INTO soft VALUES( 'J', '4', '藏.台灣印象v2', '', 'YMCK對開海報底圖');
INSERT INTO soft VALUES( 'J', '5', '藏傳唐卡經典v2', '', '唐卡具有護持功\能，經常觀即可領受「佛法無邊」之精妙。');
INSERT INTO soft VALUES( 'J', '6', '祥獅 圖庫v2', '', '傳統建築「劍獅」、「門獅」精選100');
INSERT INTO soft VALUES( 'A', '35', '我愛恐龍 v2', '', '1.集教學、遊戲、娛樂於一身的全中文化恐龍百科光碟軟體。
2.參與性很高，不僅可以發揮想像力回到史前時代去搜尋恐龍的蹤跡，還可以用照相機替恐龍拍照、用V8去攝影，馬上就能成為一位恐龍專家。
3.內容是根據美國奧勒岡科學工業博物館的設計師及科學家所發展的恐龍百科全書為藍本製作，深入淺出介紹恐龍家族。
4.一覽地球上不同時代的陸塊、植物與60幾隻精心設計的3D恐龍，親眼目睹史前時代的生物與景觀。
5.圖文並茂的說明與特殊的音效，在聲光效果中增添遊戲的趣味性，是親子互動中最生動的學習動教材。');
INSERT INTO soft VALUES( 'B', '13', '絕地大反毒-病毒百科光碟 v2', '', '');
INSERT INTO soft VALUES( 'I', '4', '虛擬博物館三', '', '');
INSERT INTO soft VALUES( 'I', '5', '虛擬博物館四', '', '');
INSERT INTO soft VALUES( 'I', '6', '電子化博物館', '', '');
INSERT INTO soft VALUES( 'k', '1', '阿毛的國語文寶盒一  v2', '低年級', '互動遊戲的設計強化孩子的聽力理解及說話能力，藉由錄音功\能及賓果遊戲等提供孩子聽、說、讀、寫全方位的國語文學習寶典。');
INSERT INTO soft VALUES( 'k', '2', '阿毛的ABC新樂園﹝一﹞ v2', '低年級', '1.走進新樂園從A到Z一次玩個夠。
2.集教學、遊戲、娛樂於一身的英文字母學習光碟軟體。
3.可選擇中文、英文二種語言發音。
4.每個字母皆以圖形變化出大寫與小寫，加深印象，並可學習一個以該字母起首的單字。並可在寫字本中練習大、小字母的寫法。
5.精心設計的場景、遊戲，在聲光效果中增添趣味性與學習效果。
6.童謠教唱可選擇單句或全曲教唱，易學易懂。
7.在塗鴉區中，小朋友可盡情揮灑創意。');
INSERT INTO soft VALUES( 'k', '3', '阿毛的ABC新樂園﹝二﹞ v2', '中、低年級', '1.聽英文、說英文、歌唱中學英文，樂趣無窮的直覺式教學。
2.特聘美國作曲家錄製英文兒歌，優美旋律中自然記憶深刻。
3.最清晰的雙語發音，好聽好學，忍不住就會跟著說。
4.從26個字母，再到100多個日常單字，再學生活句型，循序漸進。
5.在精心設計的各式遊戲中，嘗試、挑戰，快快樂樂和英文玩耍。
6.彩繪天地，拼圖與滑鼠練習，平衡手腦，同時培養創作力與邏輯。

');
INSERT INTO soft VALUES( 'k', '4', '阿毛的ABC新樂園﹝三﹞ v2', '中、低年級', '1.歌曲、動畫和遊戲，讓孩子自然想玩想學。
2.透過小猴子的引導與鼓勵，在第二階段的互動遊戲中，讓孩子不斷的嘗試與練習。
3.挑戰神偷的遊戲設計，讓孩子盡展所學，培養英文聽力，打敗神偷。');
INSERT INTO soft VALUES( 'L', '1', '阿毛的Do Re Mi 樂園(一) v.2', '低年級', '1.昱泉一年一度代表作，與美育奧福音樂教育的教授群合作，歷時十八
  個月精心製作。
2.二十八個最活潑、親切的遊戲，讓兒童在自然中學習、快樂中成長。
3.採取動態教學的概念，激發兒童的想像力、創造力。
4.三十多首針對音感訓練所創作的曲子，幫助兒童更準確的掌握語言與
  節奏。
5.採漸進式教學，兒童在認識節拍、旋律、合奏之後，可自行組合、創
  作。
6.針對幼齡 兒童，設計滑鼠練習教學。
7.內附有著色畫練習，可以讓兒童享受塗鴉的樂趣。
8.兒童可以重覆的玩，絕對不會感到厭煩。');
INSERT INTO soft VALUES( 'L', '2', '阿毛的Do Re Mi 樂園(二) v.2', '低、中、高年級', '1.以最豐富的進階學習安排，採用知名的奧福教學法，讓孩子經由經
  驗-嘗試-創造-認知的自然學習。
2.有20個活潑的活動設計，給小朋友一個自然、快樂的學習環境。
3.多了2個創作區，讓小朋友在認節拍、旋律、合奏之後，可自由發揮
  想像力，重新組合創作。
4.其中25首針對音感訓練而設計所創作的曲子，幫助小朋友精準掌握旋
  律節奏。
5.針對幼齡小朋友而設計的滑鼠教學區，讓小朋友輕鬆的手腦並用。
6.著色練習本則能讓小朋友盡情享受塗鴉的樂趣。
7.讓您的小朋友玩電腦、玩音樂、玩節奏、無壓力、只有歡樂。
 ');
INSERT INTO soft VALUES( 'k', '5', '阿毛的ABC新樂園﹝四﹞ v2', '中、低年級', '1.讓孩子在冒險遊戲中，勇往直前克服難關，建立學習的成就感與自信心。
2.針對英文入門的孩子，挑選他最熟悉、最生活化的單字與句型練習。
3.採用TPR(Total Physical Resconse)與圖像式自然語言學習法，從重複聽英文與互動練習來幫助孩子理解語文，激發學習興趣，有效率的學習英文。
4.好玩、有趣的電腦遊戲，讓孩子從認知→嘗試→挑戰的學習三部曲中，克服學英文的恐懼，快樂學會英文。
5.特聘美國作曲家針對課程的單字與句型，創作英文兒歌，引發孩子用心聽、開口唱，從遊戲、歌唱中自然學習。
6.利用電腦多媒體的特長，表現平面教學中最難理解的介係詞、動詞片語與形容、比較級的運用。');
INSERT INTO soft VALUES( 'L', '3', '阿毛的Do Re Mi 樂園(三) v.2', '', '1.在奇幻的3D場景中，18個活潑、親切的遊戲，讓孩子快樂、無壓力中
  自然而然學會音樂。
2.生活化的奧福音樂動態教學法，讓小朋友經由經驗-嘗試-創造-認知
  的過程，激發孩子潛在的想像力、創造力。
3.採漸進式教學，讓小朋友在認識節拍、旋律、樂理之後，可以發揮想
  像力盡情地的創作。
4.30首針對音感訓練所創作的曲子，由奧福音樂家們精心創作的音樂，
  能幫助小朋友由豐富的音樂中感受節奏、律動。
5.著色、塗鴉區能讓小朋友一展繪畫、創作的本領；曲譜區可以聆聽優
  美的歌曲，進而跟著朗朗上口；拼圖、滑鼠遊戲，讓小朋友輕鬆地手
  腦並用。
6.內容詳盡的「親子手冊」，引導親子共享，「用電腦玩音樂」的樂
  趣。');
INSERT INTO soft VALUES( 'D', '21', '123', '低年級&nbsp中年級&nbsp', '');
INSERT INTO soft VALUES( 'k', '6', '阿毛邏輯大冒險v.2', '低年級&nbsp中年級&nbsp', '1.首創以智能啟發利器心智圖法為主軸，進行『邏輯思考教學』的幼教軟體。
2.不同難易度、進階的學習設計。');
INSERT INTO soft VALUES( 'k', '7', '阿毛邏輯大冒險v.2', '低年級&nbsp中年級&nbsp', '1.首創以智能啟發利器心智圖法為主軸，進行「邏輯思考教學」的幼教軟體。
2.不同難易度、進階的學習設計，有系統有步驟地訓練孩子的邏輯能力。
3.新穎趣味的遊戲玩法，生動活潑的動畫演出，藉由收集寶物的過關挑戰，增進孩子學習的動力和成就感。
4.冒險結束，將頒發「冒險證書」，看看這次的冒險能到了幾顆星？可以列印出來，為孩子的學習表現留下紀錄。
5.奇幻童話風格的冒險故事+美麗光影營造遊戲情境，為童年留下美麗記憶。
6.詳盡的親子手冊，提供親子最清楚的學習導引；創意十足的心智圖法練習本及彩筆組合，讓孩子輕鬆學以致用。');
INSERT INTO soft VALUES( 'D', '22', '阿毛的塗鴉屋v.2', '低年級&nbsp中年級&nbsp', '1.貼、貼、貼！300張五花八門的貼紙，隨孩子上貼下貼、左貼右貼，上下相反、左右顛倒貼......盡情貼個痛快！
2.做卡片！8種款式卡片背影，再加上30種稱謂、祝賀辭，讓孩子自己做卡片，列印出來送給喜歡的人留念！
3.畫、畫、畫！36色彩色畫筆，還有4種不同粗細，在8張彩色圖畫紙裡，任意揮灑創意！
4.15張各式精美圖形，等孩子們來妝點色彩。
5.90種俏皮音效，一畫就有驚喜，鼓舞起孩子的創作力。
6.孩子的得意大作，隨時可以欣賞，儲存、列印，一點也不麻煩。');
INSERT INTO soft VALUES( 'D', '23', '阿毛的拼圖樂園', '低年級&nbsp', '1.各式各樣、不同組合的拼圖，帶給孩子不同的驚喜與挑戰。
2.特聘音樂專家創作生動的旋律，讓孩子在創意的樂曲中，發揮腦力的潛能。
3.DIY的拼圖組合，親子一起動手、樂趣無窮。');
