<?php
//	include "../include/config.php";
	$join_temp_arr["父母關係"] = array("1"=>"同住","2"=>"分住","3"=>"分居","4"=>"離婚","5"=>"父亡","6"=>"父母雙亡","7"=>"父不詳","8"=>"母不詳");
	$join_temp_arr["家庭類型"] = array("1"=>"雙親","2"=>"單親","3"=>"失親");
	$join_temp_arr["家庭氣氛"] = array("1"=>"和諧","2"=>"普通","3"=>"不和諧");
	$join_temp_arr["管教方式"] = array("1"=>"民主","2"=>"權威","3"=>"放任");
	$join_temp_arr["居住情形"] = array("1"=>"與父母同住","2"=>"與父同住","3"=>"與母同住","4"=>"與祖父母同住","5"=>"與親戚同住","6"=>"寄住友人家","7"=>"獨居","8"=>"租屋居住","99"=>"其他");
	$join_temp_arr["經濟狀況"] = array("1"=>"富裕","2"=>"小康","3"=>"普通","4"=>"清寒","5"=>"貧困");
	$join_temp_arr["喜愛困難科目"] = array("1"=>"道德與健康","2"=>"國語","3"=>"數學","4"=>"自然","5"=>"社會","6"=>"唱遊","7"=>"音樂","8"=>"體育","9"=>"美勞","10"=>"團體活動","11"=>"輔導活動","12"=>"鄉土教學活動","13"=>"電腦","99"=>"其他");
	$join_temp_arr["特殊才能"] = array("1"=>"球類","2"=>"田徑","3"=>"游泳","4"=>"國術","5"=>"美術","6"=>"音樂演奏","7"=>"歌唱","8"=>"工藝","9"=>"家事","10"=>"演說","11"=>"寫作","12"=>"舞蹈","13"=>"戲劇","14"=>"書法","15"=>"珠算","16"=>"領導","17"=>"英打","18"=>"中打","19"=>"外語","20"=>"電腦","99"=>"其他");
	$join_temp_arr["興趣"] = array ("1"=>"電視電影","2"=>"閱讀","3"=>"登山","4"=>"露營","5"=>"旅行郊遊","6"=>"划船游泳","7"=>"釣魚","8"=>"國術","9"=>"樂器演奏","10"=>"歌唱","11"=>"音樂欣賞","12"=>"舞蹈","13"=>"繪畫","14"=>"集郵","15"=>"打球","16"=>"打球","17"=>"編織","18"=>"下棋","19"=>"養小動物","20"=>"作物栽培","21"=>"電腦","99"=>"其他");
	$join_temp_arr["生活習慣"] = array("1"=>"整潔","2"=>"勤勞","3"=>"節儉","4"=>"作息有規律","5"=>"骯髒","6"=>"懶惰","7"=>"浪費","8"=>"作息無規律","99"=>"其他");
	$join_temp_arr["人際關係"] = array("1"=>"和氣","2"=>"合群","3"=>"活潑","4"=>"信賴別人","5"=>"好爭吵","6"=>"自我中心","7"=>"冷漠","8"=>"多疑善妒","99"=>"其他");
	$join_temp_arr["外向行為"] =array("1"=>"領導力強","2"=>"健談","3"=>"慷慨","4"=>"熱心公益","5"=>"欺侮同學","6"=>"常講粗話","7"=>"好遊蕩","8"=>"愛唱反調","99"=>"其他");
	$join_temp_arr["內向行為"]=array("1"=>"謹慎","2"=>"文靜","3"=>"自信","4"=>"情緒穩定","5"=>"畏縮","6"=>"過份沉默","7"=>"過份依賴","8"=>"多愁善感","99"=>"其他");
	$join_temp_arr["學習行為"] = array("1"=>"專心","2"=>"積極努力","3"=>"有恆心","4"=>"沈思好問","5"=>"分心","6"=>"分心","7"=>"被動馬虎","8"=>"半途而廢","9"=>"偏心某科","99"=>"其他");
	$join_temp_arr["不良習慣"] = array("1"=>"發怪聲","2"=>"口吃","3"=>"作弄他人","4"=>"吃手指頭","5"=>"咬筆","6"=>"沉迷不良書刊","7"=>"沉迷電動玩具","8"=>"上課吃東西","9"=>"說謊","10"=>"吸煙","11"=>"吸毒","99"=>"其他");
	$join_temp_arr["焦慮行為"] = array("1"=>"無","2"=>"表情緊張","3"=>"發抖","4"=>"胸痛","5"=>"坐立不安","6"=>"玩弄東西","7"=>"肚子痛","8"=>"頭痛","9"=>"思考障礙","99"=>"其他");

//加入選項

while (list($tid,$arr) = each($join_temp_arr)) {
	if (join_sfs_text(1,$tid,$arr))
		echo "$tid  已加入選項<br>";
	else
		echo "$tid  無法加入<br>";
}
	


$join_temp2_arr["non_display"] = array("20"=>"CVS");
//加入選項

while (list($tid,$arr) = each($join_temp2_arr)) {
	if (join_sfs_text(3,$tid,$arr))
		echo "$tid  已加入選項<br>";
	else
		echo "$tid  無法加入<br>";
}
	
?>
