<?php
//$Id: module-cfg.php 6414 2011-04-21 08:23:58Z infodaes $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "charge_item";
$MODULE_TABLE_NAME[1] = "charge_detail";
$MODULE_TABLE_NAME[2] = "charge_decrease";
$MODULE_TABLE_NAME[3] = "charge_record";


//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------


$MODULE_PRO_KIND_NAME = "收費管理";


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="1.0.0";

// 模組最後更新日期
$MODULE_UPDATE="2006-07-10";


//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------

//目錄內程式
$MENU_P = array(
"item.php"=>"項目設定","detail.php"=>"細目設定","list.php"=>"收費名單","decrease.php"=>"減免設定","decrease_class.php"=>"班級減免","csv.php"=>"CSV輸出","announce.php"=>"收費通知","received.php"=>"繳款登錄","barcode.php"=>"條碼收款登錄","paid_summary.php"=>"收款統計","paid_list.php"=>"繳款清冊","hie.php"=>"催繳清冊","record.php"=>"紀錄維護","class_summary.php"=>"班級統計","detail_summary.php"=>"細目統計");

//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup
// 供您取用目前這個變數的最新狀況值，
//
// 使用法：
//
// $ret_array =& get_module_setup("module_makeer")
//
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

$IS_MODULE_ARR = array("Y"=>"是","N"=>"否");

$SFS_MODULE_SETUP[0]=
	array('var'=>"types", 'msg'=>"收費類別(請以英文逗號(\",\")分隔)", 'value'=>"註冊費,課後托育,學習輔導,才藝研習");
$SFS_MODULE_SETUP[1] =
        array('var'=>"is_sort", 'msg'=>"項目前導排序代號? ( 是/否 )", 'value'=>$IS_MODULE_ARR);
$SFS_MODULE_SETUP[2]=
	array('var'=>"authority", 'msg'=>"依據參照(請以英文逗號(\",\")分隔)", 'value'=>"台中縣政府教國字第XXXXXX號函,台中縣政府教學字第XXXXXX號函,本校XX學年度X學期XXX實施計畫,");
$SFS_MODULE_SETUP[3]=
	array('var'=>"paid_method", 'msg'=>"繳款方式參照(請以英文逗號(\",\")分隔)", 'value'=>"請繳交至班級導師,XX郵局代收　帳號：xx-xxx-xxxx-x,XX銀行XX分行代收　帳號：xx-xxx-xxxx-x,請繳交至ｘｘ處ｘｘ組,");
$SFS_MODULE_SETUP[4]=
	array('var'=>"footer", 'msg'=>"收費單據註腳", 'value'=>"經手人：　　　　　　　　出納：王○○　　　　　　　會計：徐○○　　　　　　　校長：鐘○○");
$SFS_MODULE_SETUP[5]=
	array('var'=>"detail_types", 'msg'=>"細目收歸帳戶參照(請以英文逗號(\",\")分隔)", 'value'=>"學校公庫,合作社");
$SFS_MODULE_SETUP[6]=
	array('var'=>"detail_lists", 'msg'=>"細目收歸帳戶參照列表欄位數(請以英文逗號(\",\")分隔)", 'value'=>"10,10");
?>
