<?php


//---------------------------------------------------
// 這裡請放上程式的識別 Id，寫法： $ + Id + $
// SFS 開發小組幫您放入 SFS 的 CVS Server 時
// 會自動維護此一變數，注意! 請放在註解範圍中，如下所示：
//
//---------------------------------------------------

// $Id: config.php 6561 2011-09-27 03:59:20Z infodaes $

//---------------------------------------------------
//
// 模組系統相關的設定檔，一定要引入，所以使用 require !!!
//
//---------------------------------------------------
// 引入 SFS 設定檔，它會幫您載入 SFS 的核心函式庫
include_once "../../include/config.php";
include_once "../../include/sfs_case_studclass.php";
require_once "./module-cfg.php";
require_once "./module-upgrade.php";


 //取得模組參數設定
$m_arr =& get_module_setup("cita");
extract($m_arr, EXTR_OVERWRITE);

$bonus_max=$bonus_max?$bonus_max:12;
$MAX_ITEM=$MAX_ITEM?$MAX_ITEM:12;

if($my_grada) $grada=explode(',',$my_grada);

$PHP_SELF = $_SERVER["PHP_SELF"] ;


//---------------------------------------------------
// 這裡請引入 SFS 學務系統的相關函式庫。
//
// 至於要引入那些呢？
//
// 1. sfs3/include/config.php 經常是需要的。
//
// 2. 其它，就視您的程式目的而定。
// 請注意!!!!! 這裡只能使用 include_once 或 include
//---------------------------------------------------



//---------------------------------------------------
// 這裡請引入您自己的函式庫
//
// 沒有的話，可以略過。
// 請注意!!!!! 這裡只能使用 include_once 或 include
//---------------------------------------------------

// 待您填入





//---------------------------------------------------
// 
// 變數定義，請至：module-cfg.php
// 
//
//---------------------------------------------------


?>
