<?php

// $Id: module-cfg.php 8609 2015-11-25 06:05:53Z qfon $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
//
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "cita_data";
$MODULE_TABLE_NAME[1] = "cita_kind";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------
// 您這個模組的名稱，就是您這個模組放置在 SFS 中的目錄名稱


$MODULE_PRO_KIND_NAME = "學生榮譽榜";


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="1.0.0";

// 模組最後更新日期
$MODULE_UPDATE="2005-03-01 ";

// 需要使用管理者權限
$MODULE_MAN=true  ;
//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------


//選單
$menu_p = array("citaList.php"=>"榮譽榜列表及管理","citaAdmin.php"=>"新增榮譽榜","citaRank.php"=>"排行榜","help.php"=>"輔助說明");

//榮譽榜分級
$grada = array("校內活動","全校競賽","學習表現","全鄉(鎮市)錦標","縣級社團","全縣錦標","全國社團","全國錦標") ;

//學生狀態
$cond_arr = array("","","","","","畢業","","","轉出") ;


//輸入欄位類別
$INPUT_MODE =  array("s" =>"字串" , "n"=>"數字" , "d"=>"日期") ;


//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup
// 供您取用目前這個變數的最新狀況值，
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

$SFS_MODULE_SETUP[0]=array('var'=>"MARK", 'msg'=>"預設獎狀抬頭", 'value'=>"恭喜你參加");
$SFS_MODULE_SETUP[1]=array('var'=>"BODY2", 'msg'=>"預設獎狀祝語", 'value'=>"，我們都為你感到高興，特別頒發獎狀鼓勵，希望你繼續努力，更上層樓。");
$SFS_MODULE_SETUP[2]=array('var'=>"my_grada", 'msg'=>"預設獎項分類", 'value'=>"校內活動,全校競賽,學習表現,全區錦標,市級社團,全市錦標,全國社團,全國錦標");
$SFS_MODULE_SETUP[3]=array('var'=>"MAX_ITEM", 'msg'=>"預設榮譽項目選項數", 'value'=>12);
$SFS_MODULE_SETUP[4]=array('var'=>"bonus_max", 'msg'=>"預設榮譽積分最大值", 'value'=>12);
$SFS_MODULE_SETUP[5]=array('var'=>"bonus_mode", 'msg'=>"榮譽積分計算方法", 'value'=>array("0"=>"依照榮譽項目的設定","1"=>"依照填報時取得的積分"));
$SFS_MODULE_SETUP[6]=array('var'=>"rank_list", 'msg'=>"預設排行人數", 'value'=>5);
$SFS_MODULE_SETUP[7]=array('var'=>"title_default", 'msg'=>"預設印表標題", 'value'=>'榮譽積分排行榜');

// 第2,3,4....個，依此類推：

 $SFS_MODULE_SETUP[8] =
	array('var'=>"viewfullname", 'msg'=>"是否顯示學生姓名", 'value'=>array("0"=>"顯示","1"=>"不顯示","2"=>"遮罩顯示"));

 $SFS_MODULE_SETUP[9] =
	array('var'=>"viewyn", 'msg'=>"是否顯示學生年級班級座號學號", 'value'=>array("0"=>"年級班級座號學號均顯示","1"=>"僅顯示班級座號學號","2"=>"僅顯示年級和學號"));

?>
