<?php



// $Id: module-cfg.php 5310 2009-01-10 07:57:56Z hami $



//---------------------------------------------------

//

// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)

//   這區的 "變數名稱" 請勿改變!!!

//-----------------------------------------------

//

// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義

//

// 也可以用以下這種設法：

//

// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");

// 

// $MODULE_TABLE_NAME[0] = "lunchtb";

// $MODULE_TABLE_NAME[1]="xxxx";

//

// 請注意要和 module.sql 中的 table 名稱一致!!!

//---------------------------------------------------



// 資料表名稱定義



$MODULE_TABLE_NAME[0] = "lunch_feedback";



//---------------------------------------------------

//

// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)

//

// 它會顯示給使用者

//-----------------------------------------------





$MODULE_PRO_KIND_NAME = "午餐意見調查";



// 需要使用管理者權限
$MODULE_MAN=true;


//---------------------------------------------------

//

// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)

//    這區的 "變數名稱" 請勿改變!!!

//

//---------------------------------------------------



// 模組最後更新版本

$MODULE_UPDATE_VER="1.0";



// 模組最後更新日期

$MODULE_UPDATE="2006-09-17";



//目錄內程式
$MENU_P = array(
"feedback.php"=>"意見填報","class_list.php"=>"結果列表","memo_summary.php"=>"文字意見匯整","analysis.php"=>"滿意度統計分析");


//---------------------------------------------------

//

// 4. 這裡請定義：您這支程式需要用到的：變數或常數

//---------------------------------^^^^^^^^^^

//

// (不想被 "模組參數管理" 控管者，請置放於此)

//

// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。

//

// 這區的 "變數名稱" 可以自由改變!!!

//

//---------------------------------------------------



//---------------------------------------------------



$SFS_MODULE_SETUP[0] =
	array('var'=>"quantity_ref", 'msg'=>"數量滿意度調查選項(請用,分隔)", 'value'=>"太多,太少,適量");

$SFS_MODULE_SETUP[1] =
	array('var'=>"taste_ref", 'msg'=>"色香味滿意度調查選項(請用,分隔)", 'value'=>"滿意,尚可,須改進");

$SFS_MODULE_SETUP[2] =
	array('var'=>"hygiene_ref", 'msg'=>"衛生安全滿意度調查選項(請用,分隔)", 'value'=>"滿意,尚可,須改進");

$SFS_MODULE_SETUP[3] =
	array('var'=>"period", 'msg'=>"可填報日期天數", 'value'=>7);
	
$SFS_MODULE_SETUP[4] =
	array('var'=>"list_period", 'msg'=>"列表觀視日期天數", 'value'=>30);
	
$IS_MODULE_ARR = array("Y"=>"是","N"=>"否");
$SFS_MODULE_SETUP[5] =
	array('var'=>"warning", 'msg'=>"顯示尚未填報班級?( 是/否 )", 'value'=>$IS_MODULE_ARR);


// 第2,3,4....個，依此類推： 



// $SFS_MODULE_SETUP[1] =

//	array('var'=>"xxxx", 'msg'=>"yyyy", 'value'=>0);



// $SFS_MODULE_SETUP[2] =

//	array('var'=>"ssss", 'msg'=>"tttt", 'value'=>1);



?>