<?php
//$Id: module-cfg.php 9215 2018-04-09 07:56:25Z chiming $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
//
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "stud_subkind";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------


$MODULE_PRO_KIND_NAME = "學生身份類別與屬性";

// 需要使用管理者權限
$MODULE_MAN=true;


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="1.0.0";

// 模組最後更新日期
$MODULE_UPDATE="2006-02-09";


//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------

//目錄內程式
$MENU_P = array(
"setkind.php"=>"身份類別設定","setsubkind.php"=>"類別屬性設定"
,"setreference.php"=>"選單參照設定","statistics.php"=>"人數分析統計"
,"grouping.php"=>"身分別群組設定","filtering.php"=>"群組名單篩選"
,"setsubkindshow.php"=>"班級總報表"
);


//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup
// 供您取用目前這個變數的最新狀況值，
//
// 使用法：
//
// $ret_array =& get_module_setup("module_makeer")
//
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

$IS_MODULE_ARR = array("N"=>"否","Y"=>"是");
$FAMILY_KIND_ARR = array("0"=>"","1"=>"雙親","2"=>"單親","3"=>"失親");


$SFS_MODULE_SETUP[0] =
        array('var'=>"set_ref", 'msg'=>"開放導師可以設定選單參照? ( 是/否 )", 'value'=>$IS_MODULE_ARR);
$SFS_MODULE_SETUP[1] =
        array('var'=>"free_input", 'msg'=>"開放導師可以自由輸入? ( 是/否 )", 'value'=>$IS_MODULE_ARR);
$SFS_MODULE_SETUP[2] =
        array('var'=>"foreign_id", 'msg'=>"外籍或配偶子女身分註記代號:", 'value'=>100);
$SFS_MODULE_SETUP[3] =
        array('var'=>"yuanzhumin_id", 'msg'=>"原住民身分註記代號:", 'value'=>9);
$SFS_MODULE_SETUP[4] =
        array('var'=>"default_family_kind", 'msg'=>"預設親屬關係?", 'value'=>$FAMILY_KIND_ARR);




//$SFS_MODULE_SETUP[0] =
//        array('var'=>"xxxx", 'msg'=>"yyyy", 'value'=>1);

// 第2,3,4....個，依此類推：

// $SFS_MODULE_SETUP[1] =
//        array('var'=>"xxxx", 'msg'=>"yyyy", 'value'=>0);

// $SFS_MODULE_SETUP[2] =
//        array('var'=>"ssss", 'msg'=>"tttt", 'value'=>1);

?>
