<?php
//$Id: config.php 6064 2010-08-31 12:26:33Z infodaes $
include_once "../../include/config.php";
include_once "../../include/sfs_case_dataarray.php";
require_once "./module-cfg.php";

//取得模組參數的類別設定
$m_arr =&get_module_setup("sms_mitake");
$menu_p = array("sms_teacher.php"=>"發送給教職員","sms_guardian.php"=>"發送給班級學生監護人","sms_sp_guardian.php"=>"發送給特殊身分學生監護人","sms_record.php"=>"發送記錄","sms_statistics.php"=>"發送統計");

//$StatusFlagArray=array(0=>'預約傳送中',1=>'已送達業者',2=>'已送達業者',3=>'已送達業者',4=>'已送達手機',5=>'內容有錯誤',6=>'門號有錯誤',7=>'簡訊已停用',8=>'逾時無送達',9=>'預約已取消');

$statuscodeArray=array(
'*'=>'× 系統發生錯誤，請聯絡三竹資訊窗口人員',
'a'=>'× 簡訊發送功能暫時停止服務，請稍候再試',
'b'=>'× 簡訊發送功能暫時停止服務，請稍候再試',
'c'=>'請輸入帳號',
'e'=>'× 帳號、密碼錯誤',
'f'=>'× 帳號已過期',
'h'=>'× 帳號已被停用',
'k'=>'無效的連線位址',
'm'=>'必須變更密碼，在變更密碼前，無法使用簡訊發送服務',
'n'=>'密碼已逾期，在變更密碼前，將無法使用簡訊發送服務',
'p'=>'沒有權限使用外部Http程式',
'r'=>'系統暫停服務，請稍後再試',
's'=>'帳務處理失敗，無法發送簡訊',
't'=>'簡訊已過期',
'u'=>'簡訊內容不得為空白',
'v'=>'× 無效的手機號碼',
'0'=>'○ 預約傳送中',
'1'=>'△ 已送達業者',
'2'=>'已送達業者',
'3'=>'已送達業者',
'4'=>'▲ 已送達手機',
'5'=>'× 內容有錯誤',
'6'=>'× 門號有錯誤',
'7'=>'× 簡訊已停用',
'8'=>'× 逾時無送達',
'9'=>'預約已取消');

/*
$StatusstrArray=(
'DELIVRD'=>'已送達手機',
'EXPIRED'=>'逾時無法送達',
'DELETED'=>'預約已取消',
'UNDELIV'=>'無法送達(門號有錯誤/簡訊已停用)',
'ACCEPTD'=>'簡訊處理中(0=預約中，1,2,3=已送達電信業者)',
'UNKNOWN'=>'無效的簡訊狀態，系統有錯誤',
'REJECTD'=>'',
'SYNTAXE'=>'簡訊內容有錯誤');
*/
?>
