// 撰寫 SFS3 函式規範：
//
// $Id: function.tpl 5310 2009-01-10 07:57:56Z hami $
//
//---------------------------------------------------------------------------------------
// 1. 要有說明：能詳盡解釋一下您的函式用途，那是最棒的，不然也要有個簡單的描述。
//    如以下 get_module_setup 這個函式一樣。
//---------------------------------------------------------------------------------------
// 說明：
//
// 本函式
// 提供模組作者取得被控管的 "模組變數"，該模組作者便可針對該變數的現況，做適當的程式動作
// 比如：原先每頁顯示留言筆數的預設值為 15 筆，現在經由 "模組設定" 修改為 10，那麼
// 模組程式對此要有感知，此函式就是提供模組作者，方便取得這些變數的現況，而不必每位模組
// 作者都要針對這部份寫一個函式。
//
//
//---------------------------------------------------------------------------------------
// 2. 請列舉參數規定，如以下所示：
//---------------------------------------------------------------------------------------
// 參數規定：
//
// 傳入：變數 $pm_name : 模組的英文名稱，例值：lunch
// 傳回：$MSETUP 一維陣列的參考(reference)
//
//
//---------------------------------------------------------------------------------------
// 3. 請示範用例：
//---------------------------------------------------------------------------------------
// 呼叫法用例：
//
// $pm_name="lunch";
// $MSETUP =& get_module_setup($pm_name)
// 
// 經上述呼叫之後，模組作者取用變數的方法：
//
// 假設控管變數有： page_num 、have_line
//
// 則：
//
// $page_num  = $MSETUP[page_num];
// $have_line = $MSETUP[have_line]
//
//--------------------------------------------------------------------------------------- 
// 4. 對傳入值及傳回值要做檢查：
//---------------------------------------------------------------------------------------
// 比如對傳入值做檢查：
//
// if (!$pm_name) trigger_error("錯誤： 沒有傳入模組英文名稱! 請檢查!", E_USER_ERROR);
// 
// 傳入值檢查，可能要包括：
//
// A. 使用的資料庫物件($CONN)是否存在？
// B. 傳入的參數值存在與否？
// C. 使用者叫用時，傳入的值，是否合乎您的預期，比如：預期為整數，卻傳入小數
// (請勿小看這個，PHPNuke 在評分機制中由使用者選擇1~5分，
// 但卻未做詳細檢查，造成cracker利用它來入侵破壞)
// D. 是否為合理範圍，比如：開班級數若傳入 1000，是否造成程式當掉？
//
// 傳回值檢查，可能要包括：
// 
// A. 傳回的值是否存在？
// B. 欲傳回的 array 是否存在？每個傳回的陣列，塞值進去之前最好做初始化，以免判斷條件沒有進入時
//    造成該 array 不存在。
// C. select 出來的 recordset 是否有東西？
// D. 傳回值若為大型物件，是否應改為 call by reference ？return reference
// 註：PHP5 已強制為 call by/return reference 了
//
//----------------------------------------------------------------------------------------
// 5. 程式碼中要有適當的註解
//----------------------------------------------------------------------------------------

// 取得被控管的 "模組變數" key 及 值
function &get_module_setup($pm_name) {
	global $CONN;

	// 沒有傳入模組名稱，不予處理。
	if (!$pm_name) trigger_error("錯誤： 沒有傳入模組英文名稱! 請檢查!", E_USER_ERROR);

	// 確定資料庫連線成立
	if (!$CONN) user_error("資料庫連線不存在！請檢查相關設定！",256);

	// 傳回陣列予以初始化，以免無值時，傳回不當。
	$MSETUP=array();

	// 取出控管變數的名稱及值
	$sql="SELECT pm_item, pm_value FROM pro_module WHERE pm_name='$pm_name'";

	// 對 select 結果一定要檢查是否有取出東東
	if (!($res=$CONN->Execute($sql))) {
		print $CONN->ErrorMsg();
	} else {
		while ($ar=$res->FetchRow()) {
			$MSETUP[$ar[0]]=$ar[1];
		}
	}
	// access 型態的 function，一定要有傳回值
	return $MSETUP;
}

?>
