<?php

// $Id: module-cfg.php 5310 2009-01-10 07:57:56Z smallduh $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

//$MODULE_TABLE_NAME[0] = "career_self_ponder";  			//資料表1
//$MODULE_TABLE_NAME[1] = "";				//資料表2

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------

$MODULE_PRO_KIND_NAME = "生涯輔導班級幹部管理";

// 需要使用管理者權限
$MODULE_MAN=true;


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="1.0";

// 模組最後更新日期
$MODULE_UPDATE="2013-07-24";


//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------

//目錄內程式
$school_menu_p["leader_input.php"]="登錄/修改幹部記錄";
$school_menu_p["leader_paste.php"]="快貼整學期幹部記錄";
//$school_menu_p["leader_list.php"]="幹部記錄瀏覽";


//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 取用方法:
//   $M_SETUP=get_module_setup('模組名稱(資料夾英文名稱)');
//    可得到 $M_SETUP['PAGENUM']=10;
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup
// 供您取用目前這個變數的最新狀況值，
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

// 第2,3,4....個，依此類推： 
$SFS_MODULE_SETUP[] = array('var'=>"input_method", 'msg'=>"幹部與小老師名稱輸入方式", 'value'=>array(0=>'自由輸入',1=>'選項限定'));
$SFS_MODULE_SETUP[] = array('var'=>"name_list", 'msg'=>"幹部名稱選項", 'value'=>'班長,副班長,學藝股長,風紀股長,衛生股長,服務股長,總務股長,事務股長,康樂股長,體育股長,輔導股長,特殊服務表現');
$SFS_MODULE_SETUP[] = array('var'=>"name_list2", 'msg'=>"小老師名稱選項", 'value'=>'國文小老師,英語小老師,數學小老師,理化小老師,社會小老師,自然小老師,體育小老師');

$SFS_MODULE_SETUP[] = array('var'=>"max_leader1", 'msg'=>"每班最多幹部人數", 'value'=>'8');
$SFS_MODULE_SETUP[] = array('var'=>"max_leader2", 'msg'=>"每班最多小老師人數", 'value'=>'8');


// $SFS_spppppppMODULE_SETUP[2] =
//	array('var'=>"ssss", 'msg'=>"tttt", 'value'=>1);

?>