<?php

// $Id: module-cfg.php 8111 2014-09-09 01:31:25Z smallduh $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此  陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義

$MODULE_TABLE_NAME[0] = "";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------


$MODULE_PRO_KIND_NAME = "班級學籍管理";


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="";

// 模組最後更新日期
$MODULE_UPDATE="";

//重要模組，免被勿刪
$SYS_MODULE=1;
//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------


//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup
// 供您取用目前這個變數的最新狀況值，
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

// =
//	array('var'=>"IS_STANDALONE", 'msg'=>"是否有獨立的界面(1是,0否)", 'value'=>0);


// 第2,3,4....個，依此類推： 

$SFS_MODULE_SETUP[0] =array('var'=>"stud_list_enable", 'msg'=>"學籍表是否開放級任老(導)師修改", 'value'=>array("0"=>"否","1"=>"是"));
$SFS_MODULE_SETUP[1] =array('var'=>"home_ip", 'msg'=>"本模組是否只允許校內操作", 'value'=>array("0"=>"否","1"=>"是"));
$SFS_MODULE_SETUP[2] =array('var'=>"eduh_input_method", 'msg'=>"學期輔導輸入方式", 'value'=>array("0"=>"代碼輸入式","1"=>"勾選式"));
$SFS_MODULE_SETUP[3] =array('var'=>"completeness", 'msg'=>"輔導A表項目強制須輸入完整", 'value'=>array("0"=>"是","1"=>"否"));
$SFS_MODULE_SETUP[4] =array('var'=>"talk_length", 'msg'=>"輔導訪談內容中文字字數限制", 'value'=>50);
$SFS_MODULE_SETUP[5] =array('var'=>"teach_subject", 'msg'=>"輔導A表可填報任教科目", 'value'=>'輔導,輔導活動,綜合活動');
$SFS_MODULE_SETUP[6] =array('var'=>"interview_methods", 'msg'=>"訪談方式選項(以,分隔)", 'value'=>'電話訪談,家庭訪視,個別訪談,團體輔導');
$SFS_MODULE_SETUP[7] =array('var'=>"update_site_num", 'msg'=>"導師可改學生座號月分(限國小)", 'value'=>'9,3');


// $SFS_MODULE_SETUP[2] =
//	array('var'=>"ssss", 'msg'=>"tttt", 'value'=>1);

?>
