<?php

// $Id: module-cfg.php 5310 2009-01-10 07:57:56Z hami $

//---------------------------------------------------
//
// 1.這裡定義：模組資料表名稱 (供 "模組權限設定" 程式使用)
//   這區的 "變數名稱" 請勿改變!!!
//-----------------------------------------------
//
// 若有一個以上，請接續此 $MODULE_TABLE_NAME 陣列來定義
//
// 也可以用以下這種設法：
//
// $MODULE_TABLE_NAME=array(0=>"lunchtb", 1=>"xxxx");
// 
// $MODULE_TABLE_NAME[0] = "lunchtb";
// $MODULE_TABLE_NAME[1]="xxxx";
//
// 請注意要和 module.sql 中的 table 名稱一致!!!
//---------------------------------------------------

// 資料表名稱定義
//班級檔
$MODULE_TABLE_NAME[0] = "exam_kind";
//作業檔
$MODULE_TABLE_NAME[1] = "exam";
//學生名冊
$MODULE_TABLE_NAME[2] = "exam_stud";
//學生作業
$MODULE_TABLE_NAME[3] = "exam_stud_data";

//---------------------------------------------------
//
// 2.這裡定義：模組中文名稱，請精簡命名 (供 "模組權限設定" 程式使用)
//
// 它會顯示給使用者
//-----------------------------------------------


$MODULE_PRO_KIND_NAME = "學生作業管理";


//---------------------------------------------------
//
// 3. 這裡定義：模組版本相關資訊 (供 "自動更新程式" 取用)
//    這區的 "變數名稱" 請勿改變!!!
//
//---------------------------------------------------

// 模組最後更新版本
$MODULE_UPDATE_VER="2.0.1";

// 模組最後更新日期
$MODULE_UPDATE="2003-05-19 08:30:00";


//本模組須區分管理權
$MODULE_MAN = 1 ;
//管理權說明
$MODULE_MAN_DESCRIPTION = "具有管理權人員負責學期初作業的設定,一般權限只能開設作業";


//---------------------------------------------------
//
// 4. 這裡請定義：您這支程式需要用到的：變數或常數
//---------------------------------^^^^^^^^^^
//
// (不想被 "模組參數管理" 控管者，請置放於此)
//
// 建議：請儘量用英文大寫來定義，最好要能由字面看出其代表的意義。
//
// 這區的 "變數名稱" 可以自由改變!!!
//
//---------------------------------------------------



//---------------------------------------------------
//
// 5. 這裡定義：預設值要由 "模組參數管理" 程式來控管者，
//    若不想，可不必設定。
//
// 格式： var 代表變數名稱
//       msg 代表顯示訊息
//       value 代表變數設定值
//
// 若您決定將這些變數交由 "模組參數管理" 來控管，那麼您的模組程式
// 就要對這些變數有感知，也就是說：若這些變數值在模組參數管理中改變，
// 您的模組就要針對這些變數有不同的動作反映。
//
// 例如：某留言板模組，提供每頁顯示筆數的控制，如下：
// $SFS_MODULE_SETUP[1] =
// array('var'=>"PAGENUM", 'msg'=>"每頁顯示筆數", 'value'=>10);
//
// 上述的意思是說：您定義了一個變數 PAGENUM，這個變數的預設值為 10
// PAGENUM 的中文名稱為 "每頁顯示筆數"，這個變數在安裝模組時會寫入
// pro_module 這個 table 中
//
// 我們有提供一個函式 get_module_setup
// 供您取用目前這個變數的最新狀況值，
//
// 詳情請參考 include/sfs_core_module.php 中的說明。
//
// 這區的 "變數名稱 $SFS_MODULE_SETUP" 請勿改變!!!
//---------------------------------------------------

$SFS_MODULE_SETUP[] =
	array('var'=>"exam_title", 'msg'=>"作業系統抬頭", 'value'=>'學生作業展示');
$SFS_MODULE_SETUP[] =
	array('var'=>"default_pass", 'msg'=>"學生預設密碼", 'value'=>'1234');

$SFS_MODULE_SETUP[] =
	array('var'=>"class_cols", 'msg'=>"教室座位行數", 'value'=>4);

$SFS_MODULE_SETUP[] =
	array('var'=>"class_rows", 'msg'=>"教室座位列數", 'value'=>10);

$SFS_MODULE_SETUP[] =
	array('var'=>"is_score_img", 'msg'=>"作業成績顯示等級圖示(1 是,0 否)", 'value'=>true);

?>
