<?php
//$Id: array.php 6725 2012-03-21 02:11:58Z infodaes $
//九年一貫預設課程

$class9[1]['語文'][]="本國語文";
$class9[1]['語文'][]="鄉土語文";
$class9[1]['健康與體育']="健康與體育";
$class9[1]['生活']="生活";
$class9[1]['數學']="數學";
$class9[1]['綜合活動']="綜合活動";
//$class9[1]['彈性課程']="彈性課程";

$class9[2]['語文'][]="本國語文";
$class9[2]['語文'][]="鄉土語文";
$class9[2]['健康與體育']="健康與體育";
$class9[2]['生活']="生活";
$class9[2]['數學']="數學";
$class9[2]['綜合活動']="綜合活動";
//$class9[2]['彈性課程']="彈性課程";

$class9[3]['語文'][]="本國語文";
$class9[3]['語文'][]="鄉土語文";
$class9[3]['語文'][]="英語";
$class9[3]['健康與體育']="健康與體育";
$class9[3]['社會']="社會";
$class9[3]['藝術與人文']="藝術與人文";
$class9[3]['自然與生活科技']="自然與生活科技";
$class9[3]['數學']="數學";
$class9[3]['綜合活動']="綜合活動";
//$class9[3]['彈性課程']="彈性課程";

$class9[4]['語文'][]="本國語文";
$class9[4]['語文'][]="鄉土語文";
$class9[4]['語文'][]="英語";
$class9[4]['健康與體育']="健康與體育";
$class9[4]['社會']="社會";
$class9[4]['藝術與人文']="藝術與人文";
$class9[4]['自然與生活科技']="自然與生活科技";
$class9[4]['數學']="數學";
$class9[4]['綜合活動']="綜合活動";
//$class9[4]['彈性課程']="彈性課程";

$class9[5]['語文'][]="本國語文";
$class9[5]['語文'][]="鄉土語文";
$class9[5]['語文'][]="英語";
$class9[5]['健康與體育']="健康與體育";
$class9[5]['社會']="社會";
$class9[5]['藝術與人文']="藝術與人文";
$class9[5]['自然與生活科技']="自然與生活科技";
$class9[5]['數學']="數學";
$class9[5]['綜合活動']="綜合活動";
//$class9[5]['彈性課程']="彈性課程";

$class9[6]['語文'][]="本國語文";
$class9[6]['語文'][]="鄉土語文";
$class9[6]['語文'][]="英語";
$class9[6]['健康與體育']="健康與體育";
$class9[6]['社會']="社會";
$class9[6]['藝術與人文']="藝術與人文";
$class9[6]['自然與生活科技']="自然與生活科技";
$class9[6]['數學']="數學";
$class9[6]['綜合活動']="綜合活動";
//$class9[6]['彈性課程']="彈性課程";

$class9[7]['語文'][]="本國語文";
$class9[7]['語文'][]="鄉土語文";
$class9[7]['語文'][]="英語";
$class9[7]['健康與體育']="健康與體育";
$class9[7]['社會']="社會";
$class9[7]['藝術與人文']="藝術與人文";
$class9[7]['自然與生活科技']="自然與生活科技";
$class9[7]['數學']="數學";
$class9[7]['綜合活動']="綜合活動";
//$class9[7]['彈性課程']="彈性課程";

$class9[8]['語文'][]="本國語文";
$class9[8]['語文'][]="鄉土語文";
$class9[8]['語文'][]="英語";
$class9[8]['健康與體育']="健康與體育";
$class9[8]['社會']="社會";
$class9[8]['藝術與人文']="藝術與人文";
$class9[8]['自然與生活科技']="自然與生活科技";
$class9[8]['數學']="數學";
$class9[8]['綜合活動']="綜合活動";
//$class9[8]['彈性課程']="彈性課程";

$class9[9]['語文'][]="本國語文";
$class9[9]['語文'][]="鄉土語文";
$class9[9]['語文'][]="英語";
$class9[9]['健康與體育']="健康與體育";
$class9[9]['社會']="社會";
$class9[9]['藝術與人文']="藝術與人文";
$class9[9]['自然與生活科技']="自然與生活科技";
$class9[9]['數學']="數學";
$class9[9]['綜合活動']="綜合活動";
//$class9[9]['彈性課程']="彈性課程";
?>
